#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dcentric-health/gh-actions-vault/runs/run-xxqgicYVxi5SXPMZ

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=exact-lacewing]
data.aws_vpc.default: Reading...
data.aws_ami.selected: Reading...
aws_security_group.web-sg: Refreshing state... [id=sg-087091f7a5aff2466]
aws_instance.web: Refreshing state... [id=i-0bb4d32848a26a50e]
data.aws_ami.selected: Read complete after 0s [id=ami-07fa4e8bd1dd41957]
data.aws_vpc.default: Read complete after 1s [id=vpc-ff49b386]
data.aws_subnet_ids.all: Reading...
data.aws_subnet_ids.all: Read complete after 0s [id=vpc-ff49b386]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudformation_stack.this will be created
  + resource "aws_cloudformation_stack" "this" {
      + id            = (known after apply)
      + name          = "test-rolling"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + tags_all      = (known after apply)
      + template_body = (known after apply)
    }

  # aws_instance.web will be destroyed
  # (because aws_instance.web is not in configuration)
  - resource "aws_instance" "web" {
      - ami                                  = "ami-04e2e94de097d3986" -> null
      - arn                                  = "arn:aws:ec2:eu-west-1:277142373668:instance/i-0bb4d32848a26a50e" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-west-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0bb4d32848a26a50e" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-024250445a2b97629" -> null
      - private_dns                          = "ip-172-31-25-58.eu-west-1.compute.internal" -> null
      - private_ip                           = "172.31.25.58" -> null
      - public_dns                           = "ec2-34-244-91-186.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                            = "34.244.91.186" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "exact-lacewing-sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-5315131b" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - tenancy                              = "default" -> null
      - user_data                            = "0bd21bea1bd8ea618550fcac3d5972ede8c737a1" -> null
      - vpc_security_group_ids               = [
          - "sg-087091f7a5aff2466",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-05eef8f29b0b7fb92" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-07fa4e8bd1dd41957"
      + instance_type   = "t2.micro"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "test-rolling"
      + tags_all        = (known after apply)
      + user_data       = "IyEvYmluL2Jhc2gKCmVjaG8gIkNoZWNraW5nIHRoYXQgYWdlbnQgaXMgcnVubmluZyIKdW50aWwgJChjdXJsIC0tb3V0cHV0IC9kZXYvbnVsbCAtLXNpbGVudCAtLWhlYWQgLS1mYWlsIGh0dHA6Ly9sb2NhbGhvc3QpOyBkbwogIHByaW50ZiAnLicKICBzbGVlcCAxCmRvbmUKZXhpdF9jb2RlPSQ/CnByaW50ZiAiXG5Eb25lXG4iCmVjaG8gIkNoZWNraW5nIHRoYXQgYWdlbnQgaXMgcnVubmluZyIKZXhpdF9jb2RlPSQ/CiMgQ2FuJ3Qgc2lnbmFsIGJhY2sgaWYgdGhlIHN0YWNrIGlzIGluIFVQREFURV9DT01QTEVURSBzdGF0ZSwgc28gaWdub3JlIGZhaWx1cmVzIHRvIGRvIHNvLgojIENGTiB3aWxsIHJvbGwgYmFjayBpZiBpdCBleHBlY3RzIHRoZSBzaWduYWwgYnV0IGRvZXNuJ3QgZ2V0IGl0IGFueXdheS4KZWNobyAiUmVwb3J0aW5nICRleGl0X2NvZGUgZXhpdCBjb2RlIHRvIENsb3VkZm9ybWF0aW9uIgovb3B0L2F3cy9iaW4vY2ZuLXNpZ25hbCBcCiAgLS1leGl0LWNvZGUgIiRleGl0X2NvZGUiIFwKICAtLXN0YWNrICJ0ZXN0LXJvbGxpbmciIFwKICAtLXJlc291cmNlIEFTRyBcCiAgLS1yZWdpb24gImV1LXdlc3QtMSIgfHwgdHJ1ZQo="

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + delete_on_termination       = "true"
          + security_groups             = (known after apply)
        }
    }

  # aws_security_group.web-sg will be destroyed
  # (because aws_security_group.web-sg is not in configuration)
  - resource "aws_security_group" "web-sg" {
      - arn                    = "arn:aws:ec2:eu-west-1:277142373668:security-group/sg-087091f7a5aff2466" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-087091f7a5aff2466" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "exact-lacewing-sg" -> null
      - owner_id               = "277142373668" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-ff49b386" -> null
    }

  # random_pet.sg will be destroyed
  # (because random_pet.sg is not in configuration)
  - resource "random_pet" "sg" {
      - id        = "exact-lacewing" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "test-rolling"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-51d5e237",
          + "subnet-5315131b",
          + "subnet-6d0f7f37",
        ]
      + tags                       = {
          + "Name" = "test-rolling"
        }
      + tags_all                   = {
          + "Name" = "test-rolling"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "h1"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "h1"
        }
      + tags_all                           = {
          + "Name" = "h1"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-ff49b386"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 6
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # module.instance_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for example usage with EC2 Instances"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-rolling_instances_sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-rolling_instances_sg"
        }
      + tags_all               = {
          + "Name" = "test-rolling_instances_sg"
        }
      + vpc_id                 = "vpc-ff49b386"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + description              = "Ingress Rule"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.instance_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.loadbalancer_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for example usage with ALB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-rolling_lb_sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-rolling_lb_sg"
        }
      + tags_all               = {
          + "Name" = "test-rolling_lb_sg"
        }
      + vpc_id                 = "vpc-ff49b386"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "computed_egress_with_source_security_group_id" {
      + description              = "Egress Rule"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 11 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + lb_dns      = (known after apply)
  - web-address = "ec2-34-244-91-186.eu-west-1.compute.amazonaws.com:8080" -> null
╷
│ Warning: Deprecated Resource
│ 
│   with data.aws_subnet_ids.all,
│   on data.tf line 5, in data "aws_subnet_ids" "all":
│    5: data "aws_subnet_ids" "all" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @linerocks, Action: `pull_request`*